cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF42xL.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "EXTI" -->
    <peripheral>
      <name>EXTI</name>
      <description>External Interrupt and NMI Control</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40030000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXTINT0_7" -->
      <interrupt>
        <name>EXTINT0_7</name>
        <value>4</value>
      </interrupt>
      <!-- INTERRUPT "EXTINT8_23" -->
      <interrupt>
        <name>EXTINT8_23</name>
        <value>5</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ENIR" -->
        <register>
          <name>ENIR</name>
          <description>Enable Interrupt Request Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FF0FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EN22" -->
            <field>
              <name>EN22</name>
              <description>Bit22 of ENIR</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN21" -->
            <field>
              <name>EN21</name>
              <description>Bit21 of ENIR</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN20" -->
            <field>
              <name>EN20</name>
              <description>Bit20 of ENIR</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN19" -->
            <field>
              <name>EN19</name>
              <description>Bit19 of ENIR</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN18" -->
            <field>
              <name>EN18</name>
              <description>Bit18 of ENIR</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN17" -->
            <field>
              <name>EN17</name>
              <description>Bit17 of ENIR</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN16" -->
            <field>
              <name>EN16</name>
              <description>Bit16 of ENIR</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN15" -->
            <field>
              <name>EN15</name>
              <description>Bit15 of ENIR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN14" -->
            <field>
              <name>EN14</name>
              <description>Bit14 of ENIR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN13" -->
            <field>
              <name>EN13</name>
              <description>Bit13 of ENIR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN12" -->
            <field>
              <name>EN12</name>
              <description>Bit12 of ENIR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN7" -->
            <field>
              <name>EN7</name>
              <description>Bit7 of ENIR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN6" -->
            <field>
              <name>EN6</name>
              <description>Bit6 of ENIR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN5" -->
            <field>
              <name>EN5</name>
              <description>Bit5 of ENIR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN4" -->
            <field>
              <name>EN4</name>
              <description>Bit4 of ENIR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN3" -->
            <field>
              <name>EN3</name>
              <description>Bit3 of ENIR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN2" -->
            <field>
              <name>EN2</name>
              <description>Bit2 of ENIR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN1" -->
            <field>
              <name>EN1</name>
              <description>Bit1 of ENIR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN0" -->
            <field>
              <name>EN0</name>
              <description>Bit0 of ENIR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EIRR" -->
        <register>
          <name>EIRR</name>
          <description>External Interrupt Request Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ER22" -->
            <field>
              <name>ER22</name>
              <description>Bit22 of EIRR</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER21" -->
            <field>
              <name>ER21</name>
              <description>Bit21 of EIRR</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER20" -->
            <field>
              <name>ER20</name>
              <description>Bit20 of EIRR</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER19" -->
            <field>
              <name>ER19</name>
              <description>Bit19 of EIRR</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER18" -->
            <field>
              <name>ER18</name>
              <description>Bit18 of EIRR</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER17" -->
            <field>
              <name>ER17</name>
              <description>Bit17 of EIRR</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER16" -->
            <field>
              <name>ER16</name>
              <description>Bit16 of EIRR</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER15" -->
            <field>
              <name>ER15</name>
              <description>Bit15 of EIRR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER14" -->
            <field>
              <name>ER14</name>
              <description>Bit14 of EIRR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER13" -->
            <field>
              <name>ER13</name>
              <description>Bit13 of EIRR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER12" -->
            <field>
              <name>ER12</name>
              <description>Bit12 of EIRR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER7" -->
            <field>
              <name>ER7</name>
              <description>Bit7 of EIRR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER6" -->
            <field>
              <name>ER6</name>
              <description>Bit6 of EIRR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER5" -->
            <field>
              <name>ER5</name>
              <description>Bit5 of EIRR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER4" -->
            <field>
              <name>ER4</name>
              <description>Bit4 of EIRR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER3" -->
            <field>
              <name>ER3</name>
              <description>Bit3 of EIRR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER2" -->
            <field>
              <name>ER2</name>
              <description>Bit2 of EIRR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER1" -->
            <field>
              <name>ER1</name>
              <description>Bit1 of EIRR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ER0" -->
            <field>
              <name>ER0</name>
              <description>Bit0 of EIRR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EICL" -->
        <register>
          <name>EICL</name>
          <description>External Interrupt Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x007FF0FF</resetValue>
          <resetMask>0x007FF0FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ECL22" -->
            <field>
              <name>ECL22</name>
              <description>Bit22 of EICL</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL21" -->
            <field>
              <name>ECL21</name>
              <description>Bit21 of EICL</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL20" -->
            <field>
              <name>ECL20</name>
              <description>Bit20 of EICL</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL19" -->
            <field>
              <name>ECL19</name>
              <description>Bit19 of EICL</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL18" -->
            <field>
              <name>ECL18</name>
              <description>Bit18 of EICL</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL17" -->
            <field>
              <name>ECL17</name>
              <description>Bit17 of EICL</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL16" -->
            <field>
              <name>ECL16</name>
              <description>Bit16 of EICL</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL15" -->
            <field>
              <name>ECL15</name>
              <description>Bit15 of EICL</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL14" -->
            <field>
              <name>ECL14</name>
              <description>Bit14 of EICL</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL13" -->
            <field>
              <name>ECL13</name>
              <description>Bit13 of EICL</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL12" -->
            <field>
              <name>ECL12</name>
              <description>Bit12 of EICL</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL7" -->
            <field>
              <name>ECL7</name>
              <description>Bit7 of EICL</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL6" -->
            <field>
              <name>ECL6</name>
              <description>Bit6 of EICL</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL5" -->
            <field>
              <name>ECL5</name>
              <description>Bit5 of EICL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL4" -->
            <field>
              <name>ECL4</name>
              <description>Bit4 of EICL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL3" -->
            <field>
              <name>ECL3</name>
              <description>Bit3 of EICL</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL2" -->
            <field>
              <name>ECL2</name>
              <description>Bit2 of EICL</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL1" -->
            <field>
              <name>ECL1</name>
              <description>Bit1 of EICL</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL0" -->
            <field>
              <name>ECL0</name>
              <description>Bit0 of EICL</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
